ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/pio/pic32cx2051mtg64.h
#define PIO_PC19D_TCLK8        (1u << 19) /**< \brief Tc2 signal: TCLK8 */
#define PIO_PA6C_TIOA6         (1u << 6)  /**< \brief Tc2 signal: TIOA6 */
#define PIO_PC14D_TIOA7        (1u << 14) /**< \brief Tc2 signal: TIOA7 */
#define PIO_PC17D_TIOA8        (1u << 17) /**< \brief Tc2 signal: TIOA8 */
#define PIO_PA7C_TIOB6         (1u << 7)  /**< \brief Tc2 signal: TIOB6 */
#define PIO_PC15D_TIOB7        (1u << 15) /**< \brief Tc2 signal: TIOB7 */
#define PIO_PC18D_TIOB8        (1u << 18) /**< \brief Tc2 signal: TIOB8 */
/* ========== Pio definition for TC3 peripheral ========== */
#define PIO_PD16A_TCLK10       (1u << 16) /**< \brief Tc3 signal: TCLK10 */
#define PIO_PD19C_TCLK11       (1u << 19) /**< \brief Tc3 signal: TCLK11 */
#define PIO_PD3A_TCLK9         (1u << 3)  /**< \brief Tc3 signal: TCLK9 */
#define PIO_PD14A_TIOA10       (1u << 14) /**< \brief Tc3 signal: TIOA10 */
#define PIO_PD17C_TIOA11       (1u << 17) /**< \brief Tc3 signal: TIOA11 */
#define PIO_PD0A_TIOA9         (1u << 0)  /**< \brief Tc3 signal: TIOA9 */
#define PIO_PD15A_TIOB10       (1u << 15) /**< \brief Tc3 signal: TIOB10 */
#define PIO_PD18C_TIOB11       (1u << 18) /**< \brief Tc3 signal: TIOB11 */
#define PIO_PD4A_TIOB9         (1u << 4)  /**< \brief Tc3 signal: TIOB9 */
/* ========== Pio indexes ========== */
#define PIO_PA4_IDX            4
#define PIO_PA5_IDX            5
#define PIO_PA6_IDX            6
#define PIO_PA7_IDX            7
#define PIO_PA8_IDX            8
#define PIO_PA9_IDX            9
#define PIO_PA12_IDX           12
#define PIO_PA13_IDX           13
#define PIO_PA23_IDX           23
#define PIO_PA24_IDX           24
#define PIO_PA25_IDX           25
#define PIO_PA29_IDX           29
#define PIO_PB0_IDX            32
#define PIO_PB2_IDX            34
#define PIO_PB3_IDX            35
#define PIO_PB4_IDX            36
#define PIO_PB9_IDX            41
#define PIO_PB10_IDX           42
#define PIO_PB11_IDX           43
#define PIO_PB12_IDX           44
#define PIO_PB24_IDX           56
#define PIO_PB25_IDX           57
#define PIO_PB26_IDX           58
#define PIO_PC0_IDX            64
#define PIO_PC2_IDX            66
#define PIO_PC3_IDX            67
#define PIO_PC5_IDX            69
#define PIO_PC10_IDX           74
#define PIO_PC11_IDX           75
#define PIO_PC12_IDX           76
#define PIO_PC13_IDX           77
#define PIO_PC14_IDX           78
#define PIO_PC15_IDX           79
#define PIO_PC18_IDX           82
#define PIO_PC19_IDX           83
#define PIO_PC20_IDX           84
#define PIO_PC21_IDX           85
#define PIO_PC22_IDX           86
#define PIO_PD17_IDX           113
#define PIO_PD18_IDX           114
#define PIO_PD19_IDX           115

#endif /* _PIC32CX2051MTG64_PIO_ */
